app/controllers/chats_controller.rb

  def show
   @user = User.find(params[:id])
    rooms = current_user.user_rooms.pluck(:room_id)
    user_rooms = UserRoom.find_by(user_id: @user.id, room_id: rooms)

    if user_rooms.nil?
      @room = Room.new
      @room.save
      UserRoom.create(user_id: @user.id, room_id: @room.id)
      UserRoom.create(user_id: current_user.id, room_id: @room.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 2]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" IN (?, ?) LIMIT ?  [["user_id", 1], ["room_id", 1], ["room_id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-04-07 06:27:56.473010"], ["updated_at", "2021-04-07 06:27:56.473010"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 10], ["created_at", "2021-04-07 06:48:44.201668"], ["updated_at", "2021-04-07 06:48:44.201668"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2021-04-07 06:27:56.517483"], ["updated_at", "2021-04-07 06:27:56.517483"]]

  def create
    @chat = Chat.new(chat_params)
    @chat.save
---
INSERT INTO "chats" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 10], ["message", "test"], ["created_at", "2021-04-07 06:48:47.391174"], ["updated_at", "2021-04-07 06:48:47.391174"]]